# WinderLegTooShortOrRunWidthTooGreatFailure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..WinderLegTooShortOrRunWidthTooGreatFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
One leg of the winder run is too small or the runwidth is too great.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WinderLegTooShortOrRunWidthTooGreatFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WinderLegTooShortOrRunWidthTooGreatFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WinderLegTooShortOrRunWidthTooGreatFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace